[
    {
        "id": 0,
        "year": "2022",
        "company": "Hubio Technology",
        "role": "Software Developer Intern",
        "info": [
            "Worked full-time on Hubio’s collabor8 product in a collaborative team setting with Git.",
            "Developed Python scripts (NumPy and Pandas) to transform configuration spreadsheets into source artifacts consumed by the collabor8 product.",
            "Implemented new features, routine maintenance, and bug fixes on the product (Angular)"
        ]
    },
    {
        "id": 1,
        "year": "2021-2022",
        "company": "Loblaw Companies Limited",
        "role": "Deli Clerk",
        "info": [
            "Collaborated with team members to efficiently provide high levels of customer service during high-demand influxes.",
            "Performed periodic checks on inventory and equipment maintenance to ensure food safety.",
            "Developed strategies and routines to ensure the cleanliness and security of the deli workspace at all times."
        ]
    },
    {
        "id": 2,
        "year": "2022-2023",
        "company": "UofT Engineering Strategies and Practice",
        "role": "Team Leader",
        "info": [
            "Led two separate design teams (Sep 22’ - Dec 22’ & Jan 23’ - Apr 23’) of other engineering students by employing sprint structure workflows, Gantt charts, and other project management strategies.",
            "Developed unique strategies (involving Python and Excel) to generate solutions to client problems, with the assistance of a thorough understanding and research of the underlying client need.",
            "Developed a fully-functional prototype with an interactive UI component using Arduino (C++) to present to the client and public; illustrating the team’s solution to their issue."
        ]
    },
    {
        "id": 3,
        "year": "2021-2022",
        "company": "Senator O'Connor Yearbook Team",
        "role": "Director",
        "info": [
            "Developed leadership skills while regulating the development of a high school yearbook.",
            "Ensured that the team met a client-imposed deadline by employing project management methods.",
            "Leveraged three years of previous experience to assist incoming members in using the design software - hosted in-person and online tutorials every other week.",
            "Reviewed and edited the designs of other students to provide constructive feedback.",
            "Took creative initiative when designing the yearbook."
        ]
    }
]